**1 - Create DataFrame and Series**

In [2]:
import pandas as pd

In [3]:
x= { 'Name' : ['Rose', 'John' , 'Jane', 'Mary'], 'ID' : [ 1, 2 ,3,4] , 'Departement' : [ 'Architect Group ' , 'Software Group ' , ' Design Team ' , ' Infrastructure' ], 
      'Salary' : [100000, 80000, 50000, 60000]}
df= pd.DataFrame(x)
df

   Name  ID       Departement  Salary
0  Rose   1  Architect Group   100000
1  John   2   Software Group    80000
2  Jane   3      Design Team    50000
3  Mary   4    Infrastructure   60000

The function pd.DataFrame(x) takes the dictionary x and converts it into a pandas DataFrame. A DataFrame is a 2-dimensional labeled data structure with columns of potentially different types, similar to a table in a database or an Excel spreadsheet.

 Extracts a specific column from the DataFrame

In [4]:
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [ ]:
#check the type of x
type(x)

**Access to multiple columns**

In [ ]:
z= df[['Department','Salary','ID']]
z

 **2 - <code>loc()</code> and <code>iloc()</code> functions**

In [ ]:
# Access the value on the first row and the first column

df.iloc[0, 0]

The expression df.iloc[0, 0] is used to access a specific element in a pandas DataFrame using integer-location based indexing. The iloc indexer is useful for accessing data by position (integer-based indexing).

In [ ]:
# Access the value on the first row and the third column

df.iloc[0,2]

In [ ]:
# Access the column using the name

df.loc[0, 'Salary']

In [5]:
df2=df
df2=df2.set_index("Name")

The method set_index("Name") modifies the DataFrame df2 to use the "Name" column as its index. This operation returns a new DataFrame with the "Name" column as the index, and assigns it back to df2.

In [6]:
#To display the first 5 rows of new dataframe
df2.head()

      ID       Departement  Salary
Name
Rose   1  Architect Group   100000
John   2   Software Group    80000
Jane   3      Design Team    50000
Mary   4    Infrastructure   60000

In [7]:
df2.loc['Jane', 'Salary'] #Now, let us access the column using the name

50000

In [8]:
csv_path = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/data/TopSellingAlbums.csv'
df = pd.read_csv(csv_path)
df

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,0:42:19,"pop, rock, R&B",46.0,65,30-Nov-82,NaN,10.0
1,AC/DC,Back in Black,1980,0:42:11,hard rock,26.1,50,25-Jul-80,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,0:42:49,progressive rock,24.2,45,01-Mar-73,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,0:57:44,"R&B, soul, pop",27.4,44,17-Nov-92,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,0:46:33,"hard rock, progressive rock",20.6,43,21-Oct-77,NaN,8.0
5,Eagles,Their Greatest Hits (1971-1975),1976,0:43:08,"rock, soft rock, folk rock",32.2,42,17-Feb-76,NaN,7.5
6,Bee Gees,Saturday Night Fever,1977,1:15:54,disco,20.6,40,15-Nov-77,Y,7.0
7,Fleetwood Mac,Rumours,1977,0:40:01,soft rock,27.9,40,04-Feb-77,NaN,6.5